Sergeys-MacBook-Pro:crimsonlander sergeyzyrin$ ./terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.ip will be created
  + resource "aws_eip" "ip" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + vpc               = (known after apply)
    }

  # aws_instance.terra-sample0 will be created
  + resource "aws_instance" "terra-sample0" {
      + ami                          = "ami-04169656fea786776"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.nano"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + network_interface_id         = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "768c1b444b1c0c800980b013fdb52d18d4f6ba2a"
      + volume_tags                  = (known after apply)
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.all-outbound-traffic will be created
  + resource "aws_security_group" "all-outbound-traffic" {
      + arn                    = (known after apply)
      + description            = "Allow traffic to leave the AWS instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "all-outbound-traffic-group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Outbound Traffic Security Group"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.http-group will be created
  + resource "aws_security_group" "http-group" {
      + arn                    = (known after apply)
      + description            = "Allow traffic on port 80 (HTTP)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "http-access-group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "HTTP Inbound Traffic Security Group"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.https-group will be created
  + resource "aws_security_group" "https-group" {
      + arn                    = (known after apply)
      + description            = "Allow traffic on port 443 (HTTPS)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "https-access-group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "HTTPS Inbound Traffic Security Group"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.ssh-group will be created
  + resource "aws_security_group" "ssh-group" {
      + arn                    = (known after apply)
      + description            = "Allow traffic to port 22 (SSH)"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "ssh-access-group"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "SSH Access Security Group"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.


Warning: Interpolation-only expressions are deprecated

  on terra-sample0.tf line 24, in resource "aws_eip" "ip":
  24:   instance = "${aws_instance.terra-sample0.id}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_security_group.all-outbound-traffic: Creating...
aws_security_group.ssh-group: Creating...
aws_security_group.http-group: Creating...
aws_security_group.https-group: Creating...
aws_security_group.http-group: Still creating... [10s elapsed]
aws_security_group.all-outbound-traffic: Still creating... [10s elapsed]
aws_security_group.ssh-group: Still creating... [10s elapsed]
aws_security_group.https-group: Still creating... [10s elapsed]
aws_security_group.http-group: Still creating... [20s elapsed]
aws_security_group.https-group: Still creating... [20s elapsed]
aws_security_group.ssh-group: Still creating... [20s elapsed]
aws_security_group.all-outbound-traffic: Still creating... [20s elapsed]
aws_security_group.ssh-group: Still creating... [30s elapsed]
aws_security_group.all-outbound-traffic: Still creating... [30s elapsed]
aws_security_group.https-group: Still creating... [30s elapsed]
aws_security_group.http-group: Still creating... [30s elapsed]
aws_security_group.ssh-group: Still creating... [40s elapsed]
aws_security_group.http-group: Still creating... [40s elapsed]
aws_security_group.https-group: Still creating... [40s elapsed]
aws_security_group.all-outbound-traffic: Still creating... [40s elapsed]
aws_security_group.ssh-group: Creation complete after 46s [id=sg-0c8569c942438008b]
aws_security_group.http-group: Creation complete after 46s [id=sg-0bf199e093b612d3f]
aws_security_group.all-outbound-traffic: Creation complete after 46s [id=sg-03d6101300b6fda3d]
aws_security_group.https-group: Creation complete after 46s [id=sg-006171fffb3ec48d5]
aws_instance.terra-sample0: Creating...
aws_instance.terra-sample0: Still creating... [10s elapsed]
aws_instance.terra-sample0: Still creating... [20s elapsed]
aws_instance.terra-sample0: Still creating... [30s elapsed]
aws_instance.terra-sample0: Still creating... [40s elapsed]
aws_instance.terra-sample0: Still creating... [50s elapsed]
aws_instance.terra-sample0: Still creating... [1m0s elapsed]
aws_instance.terra-sample0: Creation complete after 1m9s [id=i-02c004b39ed458a67]
aws_eip.ip: Creating...
aws_eip.ip: Still creating... [10s elapsed]
aws_eip.ip: Creation complete after 18s [id=eipalloc-019ff4686cf7e1dc8]

Apply complete! Resources: 6 added, 0 changed, 0 destroyed.

Outputs:

ip = 34.233.222.253


[zyrin.sv@calc ~]$ curl -vvv 34.233.222.253
* About to connect() to 34.233.222.253 port 80 (#0)
*   Trying 34.233.222.253...
* В соединении отказано
* Failed connect to 34.233.222.253:80; В соединении отказано
* Closing connection 0
curl: (7) Failed connect to 34.233.222.253:80; В соединении отказано